# -*- line-spacing: 0.1; -*-
#+TITLE: The Need for Demand side Fast Frequency Response and Inertia in a Zero Carbon Grid
#+STARTUP: latexpreview
#+STARTUP:  overview
#+INCLUDE: "~/.doom.d/orgReportHeader.org"
#+OPTIONS: H:3 d:nil tags:nil email:t toc:t broken-links:t ^:nil #\n:t
** Current Zero Carbon Energy Mix
#+ATTR_LATEX: :placement [H] :booktabs t
#+caption:  Breakdown of UK Zero carbon energy production in GWh for the year 2020-2021 based on UK government data [[cite:&RenewableElecricityCap]]
#+NAME: tabUkGreenEnergy2020
|   |         | Solar PV |     Wind |   Hydro |  Biomass | Nuclear | wave / tidal |     total |
|---+---------+----------+----------+---------+----------+---------+--------------+-----------|
| ! |         |    Solar |     Wind |   Hydro | Biomass  | Nuclear |         Wave |           |
| # | GWh     | 13157.99 | 75369.14 | 6753.92 |    39311 |   46000 |        11.28 | 134592.05 |
| # | Percent |      9.8 |     56.0 |     5.0 |     29.2 |    34.2 |          0.0 |           |
#+TBLFM: @3$9=vsum($4..$6)::@4$4..@4$>>=(@-1/@-1$>)*100;%.1f

#+Name: figPie2020CumGen
#+BEGIN_SRC jupyter-python :var data=tabUkGreenEnergy2020 :session test :exports results
labels = data[0][2:-2]
labels = ['\n'.join(wrap(x,20)) for x in labels]
sizes = data[1][2:-2]
fig1, ax1 = plt.subplots()
ax1.pie(sizes, labels=labels, autopct='%1.1f%%', startangle=90)
ax1.axis('equal')  # Equal aspect ratio ensures that pie is drawn as a circle.
plt.show()
#+End_src

** Current Natural gas demand <<secAppNatGasDemand>>
This data is sourced from the UK governments  Digest of United Kingdom Energy Statistics 4.2 (DUKES)[[cite:&NaturalGas]].

#+ATTR_LATEX: placement [H] :booktabs t:
#+caption: UK natural Gas Demand for 2019 Broken down by sector, Data sourced from UK Government [[cite:&NaturalGas]]
#+NAME: tabNatGasDemandBreakdown
| Sector                                                  | Consumption (GWh) | Consumption (%) |
|---------------------------------------------------------+-------------------+-----------------|
| Electricity Generation                                  |            272331 |           31.55 |
| Industry                                                |            165213 |           19.14 |
| Losses                                                  |              3410 |            0.40 |
| Domestic+Public Sector + Commercial (Non Industrial)    |            377290 |           43.71 |
| Other                                                   |             44929 |            5.21 |
|---------------------------------------------------------+-------------------+-----------------|
| total                                                   |            863174 |          100.00 |
#+TBLFM: $3=(($-1)/(@>$-1))*100;%.2f

** Biomass/Waste Energy Breakdown <<secAppBiomassWasteEner>>
#+ATTR_LATEX: :placement [H] :booktabs t :font \tiny
#+caption: Breakdown of Energy generated from Biomass/Waste (GWh) according to UK government data [[cite:&RenewableElecricityCap]]
#+NAME: tabBiomassBreakdown
|     | Landfill gas | Sewage digestion | Energy from waste | Animal Biomass | Anaerobic Digestion | Plant Biomass (inc high range co-firing) | Total |
|-----+--------------+------------------+-------------------+----------------+---------------------+------------------------------------------+-------|
|     | Landfill gas | Sewage digestion | Energy from waste | Animal Biomass | Anaerobic Digestion |                            Plant Biomass | Total |
| GWh |         3496 |             1067 |              4352 |            647 |                2904 |                                    26845 | 39311 |
| %   |          8.9 |              2.7 |              11.1 |            1.6 |                 7.4 |                                     68.3 |  100. |
#+TBLFM: $8=vsum($2..$>>)::@3$2..@3$>>=(@-1/@-1$>)*100;%.1f

#+Name: pltPie2020BiomassBreakdown
#+BEGIN_SRC jupyter-python :var data= tabBiomassBreakdown :session test :exports results
labels = data[0][1:-1]
sizes = data[1][1:-1]
fig1, ax1 = plt.subplots()
ax1.pie(sizes, labels=labels, autopct='%1.1f%%', startangle=90)
ax1.axis('equal')  # Equal aspect ratio ensures that pie is drawn as a circle.
plt.show()
#+End_src
** US Forestry Production :noexpor:
#+NAME: pltUsForrestry
#+BEGIN_SRC jupyter-python :session test
df=pd.read_csv('UnitedStatesForestry.csv')
display(df.columns)
df=df[(df["Unit"]=="tonnes")&(df["Flag"]=="Im")&(df["Element"]=="Production")]
display(len(df))
#+End_src

#+RESULTS: pltUsForrestry
:RESULTS:
: Index(['Domain Code', 'Domain', 'Area Code (FAO)', 'Area', 'Element Code',
:        'Element', 'Item Code', 'Item', 'Year Code', 'Year', 'Unit', 'Value',
:        'Flag', 'Flag Description', 'Unnamed: 14'],
:       dtype='object')
: 5
:END:

